# Запись событий в rsyslog-сервер
## Команда 
Чтобы записать событие на `rsyslog`-сервер, необходимо создать конфигурацию конечной точки логирования следующей командой:

```
aaaevents syslog add  [-h] --help
                      [--protocol PROTOCOL]
                      [--address ADDRESS]
                      [--port PORT]
                      [--use_tls USE_TLS]
                      [--ca_data CA_DATA]
                      [--ca_file CA_FILE]
                      [--log_enabled LOG_ENABLED]
```
### Аргументы команды
`[-h] --help` — отобразить это сообщение и выйти из процесса.
`[--protocol PROTOCOL]` — задать протокол передачи данных, можно задать UDP или TCP.
>[!WARNING]
>Обязательное поле!
`[--address ADDRESS]` — задать IP-адрес rsyslog-сервера или его доменное имя
>[!WARNING]
>Обязательное поле!
>[!NOTE]
>Во ВЦОД может существовать только одна конфигурация конечной точки syslog-сервера.

>[!CAUTION]
>текст предостережения

>[!WARNING]
>текст предупреждения
> Во ВЦОД может существовать только одна конфигурация конечной точки syslog-сервера.  
``
``
``
``
``
``
